# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

_list = [2, 3, 4, 5, 6]
res = []
a = 0

if len(_list)%2 == 1: 
    a = round(((len(_list))/2)+0.5)
else: a = len(_list)/2

for i in range(round(a)):
    res.append(_list[i] * _list[-i-1])

print(res)